{
  "posture": "From the postural assessment we found some positive results as well as some areas we could concentrate on for improvement.<br>Your forward head posture was measured at 2.7cm (normal is deemed 0-3cm). Your thoracic (upper back) curvature was above our gold standard range, you measured 37.0 degrees, normal is considered 30-35. We saw a reduced curvature in your lumbar spine, you measured 27.0 degrees with normal being considered 30-35.<br><br>These readings indicate you have a forward head posture. So where your forward head posture is slightly increased we could expect increased levels of force and tension being applied to the discs and muscles of your cervical and thoracic spine (neck and upper back). A reduced curve in your lumbar spine (lower back) this can be associated with worse force absorption and transference and therefore increased loading through the joints of the spine.<br><br>You were able to rotate your spine 46.0 degrees to the left and 50.0 degrees to the right, and could laterally flex (side bend) 38.0 degrees to the left and 37.0 degrees to the right.<br><br>The angle of pelvic tilt in quiet standing describes the orientation of the pelvis in the sagittal plane. It is determined by the muscular and ligamentous forces that act between the pelvis and adjacent segments. You were 6.0 (left) and 6.0 (right), normal is 7-10 degrees for females, showing your posterior tilt and matches the findings of a reduced lumbar curvature as the lumbar spine directly articulates with the sacrum and its joints with the pelvis. ",
  "core": "The core function assessments primarily evaluate TVA strength, coordination, and multifidus activation. Your results indicate some dominance of the quadratus lumborum (QL) and lower back musculature, which appear to be compensating during the lower abdominal tests. <br><br>You have a slightly decreased lumbar curvature, which is likely contributing to the observed reduction in lower abdominal strength. The Lower Abdominal Coordination Test resulted in a fail, with the left side performing worse than the right, highlighting an asymmetry in coordination and strength. While your upper core demonstrated sufficient bracing capabilities, your lower core was unable to brace effectively.<br><br>We would like to teach you to use your deep lying core muscles, build their strength, and work on their coordination with a larger emphasis on your lower abdominals.",
  "ankle": "The Left foot: Your left foot is positioned neutrally, with the ability to pronate and supinate; however, it exhibits slightly reduced capacity for pronation, primarily originating from the hip rather than the foot itself. There is minimal movement through the midfoot, indicating a lack of articulation and control in this area. Dorsiflexion range and strength are both poor, which may affect your overall stability and mobility. In contrast, plantarflexion shows good range but poor strength, suggesting a need for focused strength training, particularly through overcoming isometrics to enhance muscle engagement.<br><br>The Right foot: The right foot mirrors the left in its neutral position and ability to pronate and supinate, with similar limitations in pronation that also stem from the hip. Like the left, there is very little movement through the midfoot, indicating a bilateral issue with midfoot articulation. Dorsiflexion range and strength are poor on this side as well, while plantarflexion maintains good range but lacks strength, reflecting a consistent pattern across both feet.<br><br>Foot and Ankle summary: There is notable asymmetry between your feet, particularly in the capacity for pronation and midfoot movement. Both feet demonstrate poor dorsiflexion strength and range, which could compromise your overall foot function and stability. It is essential to prioritize building strength in both feet, particularly through isometric exercises, while also enhancing control and awareness of foot movements. Incorporating dynamic activities that promote midfoot articulation and engaging in subconscious movement patterns will be beneficial for improving overall foot function and addressing the identified weaknesses.",
  "knee": "The Left knee achieved good range in extension, 3% above our gold standard but was significantly limited in flexion, being 19% below the gold standard (distal hamstring). Additionally, the left knee demonstrated poor strength in flexion, being 46% below the gold standard, which is concerning for overall knee function. The hamstring to quadriceps ratio on the left side was classified as poor, indicating a need for improvement in the flexion/extension mechanisms. It is also noteworthy that the left knee extension strength was 10.5% weaker than the right.<br><br>The Right knee exhibited similar range limitations in flexion, lacking 18% compared to the gold standard, but was slightly stronger than the left knee in this regard, being 1.2% stronger. However, the right knee also showed poor strength in flexion, at 43% below the gold standard. Both knees had equal range in extension, but the right knee was stronger in extension, which may contribute to a less favorable hamstring to quadriceps ratio on this side.<br><br>Knee summary: While both knees show good range in extension, there is a significant need to address the deficits in flexion range and strength. Improving the peak force in flexion will be crucial for enhancing the hamstring to quadriceps ratio and overall knee stability. Focused rehabilitation on the left knee's flexion strength is particularly important to balance the strength and function between both knees.",
  "hip": "The Left hip showed excellent range in hip flexion and external rotation, but significant deficits in hip extension, abduction, and internal rotation. The large deficits in strength across multiple movements, particularly in flexion, adduction, and internal rotation, compromise overall hip joint integrity and affect movement patterns.<br><br>The Right hip demonstrated similar range capabilities in flexion and external rotation but exhibited notable deficits in hip extension, abduction, and internal rotation as well. While the strength was slightly better on average compared to the left, the large deficits in force production across all assessed movements hinder propulsion and effective energy transfer.<br><br>Hip summary: The large deficits in hip extension range on both sides negatively impact pelvic alignment, which is crucial for maintaining proper lower limb function. The significant strength deficits, particularly in flexion and abduction, further compromise propulsion and stability. The notable asymmetry in hip abduction and the inverse relationship in range of motion highlight the need for targeted interventions to improve femur positioning and overall hip joint integrity. Addressing these deficits is essential for optimizing movement patterns and enhancing functional performance.",
  "shoulder": "The Left Shoulder demonstrated excellent external rotation, exceeding the gold standard, but with a slight bias compared to the right shoulder. The internal rotation was notably weaker, falling below the gold standard, indicating a significant strength deficit in this area. The left shoulder's flexion was good and equal to the right, suggesting no limitations in this range of motion. However, when assessing isometric strength, the left shoulder showed notable reductions in the \"I,\" \"Y,\" and \"T\" positions, particularly in the \"T\" position where the reduction was significant.<br><br>The Right Shoulder exhibited greater external rotation compared to the left, also above the gold standard, but it faced a notable reduction in internal rotation, which was significantly weaker than the left shoulder. The flexion was equal to the left shoulder, indicating no discrepancies in this movement. In terms of isometric strength, the right shoulder performed better in the \"I\" position but showed notable reductions in both the \"Y\" and \"T\" positions, with a particularly significant deficit in the \"T\" position.<br><br>Shoulder Summary: There is a clear asymmetry between the left and right shoulders, particularly in internal rotation strength and isometric performance in the \"Y\" and \"T\" positions. To address these deficits, a focused approach on strengthening internal rotation and improving isometric strength through progressive overcoming isometrics is recommended. Additionally, incorporating shoulder mobilisation drills and unilateral movements will help enhance overall shoulder function and stability. Prioritizing scapula mobility and addressing the notable reductions in isometric strength will be crucial for balanced shoulder development.",
  "overall_conclusion": "Our results indicate you have a forward head posture. This is characterised by thoracic kyphosis which creates a depression of the rib cage since the thorax is tipped forward. This position often leads to the shoulders rounding forward, resulting in an externally rotated position. Additionally, there may be a loss of internal rotation at the pelvis, which can exacerbate the overall postural alignment. Addressing these postural dynamics through targeted correctives will be beneficial, as this position can have significant consequences during gait.<br><br>There are notable compensations occurring at the hip, with deficits in range and strength across both sides. Specifically, both the left and right hips exhibit limitations in extension, abduction, and internal rotation. The largest variation in range is observed in hip flexion/extension on the left side, indicating changes in femur positioning. These limitations suggest that the spine may be overused to compensate for the lack of hip function, which can affect overall propulsion strategies. It is crucial to focus on enhancing hip extension and internal rotation to improve force transfer and mid-foot awareness during movement.<br><br>In terms of knee and ankle integration, both knees show deficits in flexion and extension strength, which may impact overall joint articulation and muscle contraction quality. The ankle assessments reveal poor dorsiflexion range and strength bilaterally, with minimal midfoot movement indicating a lack of control. This could compromise your overall stability and mobility. Addressing these issues through targeted exercises to improve range of motion and tissue loading efficiency will be essential for enhancing function and reducing force discrepancies across the lower extremities.<br><br>To optimize your shoulder girdle function, we need to focus on the mechanics of the ribcage and scapula. The identified deficits in shoulder movements, particularly on the left side with the \"I\", \"Y\", and \"T\" patterns, and on the right side with internal rotation, suggest a need for a comprehensive resistance training approach. Incorporating heavy isometrics and eccentrics, alongside fascial release techniques, will help improve the engagement of the deltoids and rotator cuff complex, ultimately enhancing shoulder stability and function."
}