{
  "posture": "From the postural assessment we found some positive results as well as some areas we could concentrate on for improvement.<br>Your forward head posture was measured at 4.7cm (normal is deemed 0-3cm). Your thoracic (upper back) curvature was above our gold standard range, you measured 40.0 degrees, normal is considered 30-35. We saw a reduced curvature in your lumbar spine, you measured 15.0 degrees with normal being considered 30-35.<br><br>These readings indicate you have a forward head posture. So where your forward head posture is slightly increased we could expect increased levels of force and tension being applied to the discs and muscles of your cervical and thoracic spine (neck and upper back). A reduced curve in your lumbar spine (lower back) this can be associated with worse force absorption and transference and therefore increased loading through the joints of the spine.<br><br>You were able to rotate your spine 36.0 degrees to the left and 40.0 degrees to the right, and could laterally flex (side bend) 17.0 degrees to the left and 28.0 degrees to the right.<br><br>The angle of pelvic tilt in quiet standing describes the orientation of the pelvis in the sagittal plane. It is determined by the muscular and ligamentous forces that act between the pelvis and adjacent segments. You were 5.0 (left) and 3.0 (right), normal is 4-7 degrees for males, showing your posterior tilt and matches the findings of a reduced lumbar curvature as the lumbar spine directly articulates with the sacrum and its joints with the pelvis. ",
  "core": "The core function assessments primarily evaluate TVA strength, coordination, and multifidus activation. Your results indicate a decreased lumbar curvature, which is likely contributing to the reduced strength in your lower abdominal region. <br><br>The Lower Abdominal Coordination Test did not yield a pass, suggesting challenges in coordinating the lower abdominal muscles effectively. While your upper core demonstrated moderate bracing capabilities, your lower core was unable to brace efficiently. This discrepancy may indicate a reliance on compensatory patterns, potentially involving the quadratus lumborum (QL) and other lower back musculature, which may be taking over during core stabilization tasks.<br><br>We would like to teach you to use your deep lying core muscles, build their strength, and work on their coordination with a larger emphasis on your lower abdominals.",
  "ankle": "The Left foot: Your left foot is positioned in a slightly everted alignment, with the center of mass positioned laterally to the 2nd metatarsal. Notably, your left foot cannot pronate effectively, which may limit your ability to absorb forces during dynamic activities. While you exhibit good range in dorsiflexion, the strength in this movement is lacking, as is the strength in plantarflexion, despite having good range. To address these deficiencies, we should prioritize building strength through isometric exercises, while also enhancing your control and awareness of foot positioning.<br><br>The Right foot: In comparison, your right foot is also in a slightly everted position, but it demonstrates the ability to pronate effectively. The movement capabilities and strength profiles are similar to the left foot, with good range in both dorsiflexion and plantarflexion, yet both movements exhibit poor strength. This indicates a need for targeted strengthening on both sides, particularly in the right foot to match the left's limitations.<br><br>Foot and Ankle summary: There is a noticeable asymmetry between your feet, particularly in the pronation capabilities of the left foot compared to the right. Both feet exhibit similar everted positioning and range of motion, but the left foot's inability to pronate effectively may contribute to compensatory movement patterns. It is essential to focus on building strength through isometric exercises for both dorsiflexion and plantarflexion, while also incorporating dynamic movements to enhance fascial control and midfoot articulation. Additionally, increasing your awareness of foot positioning during daily activities can facilitate better control and function.",
  "knee": "The Left knee achieved a lack of range in flexion, 15% below our gold standard, indicating a significant limitation in the distal hamstring function. In contrast, the Right knee demonstrated sufficient range, being only 12% below the gold standard, and was 3.5% stronger than the left in this movement. However, the strength data for both knees is unknown, which limits our ability to fully assess the functional capacity of the left knee.<br><br>The Right knee showed a sufficient range in extension, 12% below the gold standard, while the Left knee had a lack of range, being 24% below the gold standard. Notably, the Left knee was 15.8% stronger than the Right knee in extension, suggesting a potential compensatory mechanism at play. Unfortunately, the strength data remains unknown for both knees, preventing a comprehensive evaluation of their performance.<br><br>Knee summary: There are notable range deficits in both knees, particularly in flexion for the Left knee and extension for the Right knee. The lack of strength data hinders a complete understanding of the knee biomechanics, but it is clear that both knees require targeted interventions to improve their range and strength, particularly focusing on enhancing the flexion capabilities of the Left knee and the extension capabilities of the Right knee.",
  "hip": "The Left hip showed significant deficits in hip flexion and extension range, which are critical for maintaining proper movement patterns and hip joint integrity. The large deficit in hip flexion strength further compromises propulsion and overall force production, while the asymmetry indicates a notable imbalance that could affect bilateral coordination during activities.<br><br>The Right hip demonstrated a large deficit in hip flexion range and a deficit in hip extension range as well. Although the strength data is unknown, the existing deficits in flexion and adduction strength may hinder effective propulsion and stability. The asymmetry in hip extension suggests that the right side may be compensating for weaknesses, potentially leading to altered movement patterns and increased risk of injury.<br><br>Hip summary: The substantial deficits in hip flexion and extension range on both sides impact pelvic alignment and overall hip joint integrity. The strength deficits, particularly in flexion and internal rotation, highlight the need for targeted interventions to improve propulsion and stability. The large asymmetries, especially in internal rotation, indicate a significant variation in femur positioning, which can affect energy transfer during both closed and open-chain movements. Addressing these deficits and asymmetries is essential for optimizing hip function and preventing further complications.",
  "shoulder": "The Left Shoulder demonstrated good external rotation, although it was below the gold standard. There was a notable asymmetry with the left shoulder being stronger in external rotation compared to the right. However, internal rotation showed a significant reduction, indicating a weakness in this area, which is concerning. Flexion was above the gold standard, suggesting good functional capacity in this movement.<br><br>The Right Shoulder also exhibited good external rotation but was slightly below the gold standard. In contrast, internal rotation was better than the left shoulder, indicating a stronger performance in this aspect. The right shoulder had a balanced external and internal rotation, which is beneficial for overall shoulder function. However, it still fell short of the gold standard in both external and internal rotation.<br><br>Shoulder Summary: The left shoulder has a notable deficit in internal rotation, which should be addressed to improve overall shoulder function. It is essential to incorporate progressive overcoming isometrics and heavy eccentric loading for internal rotation strength. Additionally, focusing on scapula mobility and shoulder mobilisation drills will help balance the asymmetries between both shoulders. Emphasizing unilateral movements will also aid in correcting the deficits observed in the left shoulder.",
  "overall_conclusion": "Our results indicate you have a forward head posture. This is characterised by thoracic kyphosis, which leads to a depression of the rib cage as the thorax tips forward. This position results in the shoulders rounding forward, often placing them in an externally rotated position. Additionally, there is typically a loss of internal rotation at the pelvis, with an increase in external rotation. Your results suggest that you would benefit from specific correctives to address this posture and improve rib cage dynamics, as this position can have negative consequences during gait.<br><br>There are evident compensations occurring at the hip, with various strategies being employed to generate forward propulsion during gait and when engaging in closed-chain movements. Limitations in both internal rotation and hip extension were noted, which indicates that the spine may be overused to create downward force. This highlights the need to enhance your awareness of the mid-foot and ensure effective pressurization through the ground to optimize force transfer.<br><br>Our approach will focus on increasing the range of motion at the hip while integrating work around the foot to promote efficient tissue loading patterns. This will help prevent overload in key areas and improve joint articulation. Enhancing range of motion will also lead to better muscle contraction quality, allowing us to address the force discrepancies observed at both the knee and hip.<br><br>To improve the efficiency of your shoulder girdle, we need to focus on the mechanics of your ribcage and scapula. A combination of heavy isometrics and eccentrics, following fascial release work, will facilitate quicker adaptation. Emphasis should be placed on strengthening the deltoids and the rotator cuff complex to enhance overall shoulder function and stability."
}