{
  "posture": "From the postural assessment we found some positive results as well as some areas we could concentrate on for improvement.<br>Your forward head posture was measured at 6.3cm (normal is deemed 0-3cm). Your thoracic (upper back) curvature was above our gold standard range, you measured 55.0 degrees, normal is considered 30-35. We saw a reduced curvature in your lumbar spine, you measured 25.0 degrees with normal being considered 30-35.<br><br>These readings indicate you have a forward head posture. So where your forward head posture is increased we could expect increased levels of force and tension being applied to the discs and muscles of your cervical and thoracic spine (neck and upper back). A reduced curve in your lumbar spine (lower back) this can be associated with worse force absorption and transference and therefore increased loading through the joints of the spine.<br><br>You were able to rotate your spine 37.0 degrees to the left and 38.0 degrees to the right, and could laterally flex (side bend) 28.0 degrees to the left and 29.0 degrees to the right.<br><br>The angle of pelvic tilt in quiet standing describes the orientation of the pelvis in the sagittal plane. It is determined by the muscular and ligamentous forces that act between the pelvis and adjacent segments. You were 4.0 (left) and 6.0 (right), normal is 4-7 degrees for males. ",
  "core": "The core function assessments primarily evaluate TVA strength, coordination, and multifidus activation. Your results indicate a slight dominance of your QL and lower back musculature, which may be compensating for the reduced activation of your lower abdominal muscles during the tests.<br><br>You have a slightly decreased lumbar curvature, which is likely contributing to the observed reduction in lower abdominal strength. The Lower Abdominal Coordination Test results show a failure, with better performance noted on the right side compared to the left, indicating an asymmetry in coordination and strength.<br><br>To address these issues, we would like to teach you to use your deep lying core muscles, build their strength, and work on their coordination with a larger emphasis on your lower abdominals.",
  "ankle": "The Left foot: Your left foot is positioned in a slightly everted alignment, with the center of mass positioned just lateral to the 2nd metatarsal. The foot demonstrates the ability to pronate and supinate effectively, although it exhibits slightly less pronation compared to the right foot. Both dorsiflexion and plantarflexion show good range and strength, indicating a well-functioning ankle joint. However, to enhance overall stability and control, it is recommended to focus on building strength through isometric exercises, particularly in the plantar flexors.<br><br>The Right foot: The right foot is similarly positioned in a slightly everted stance, but it is noted to be slightly more everted than the left. Like the left foot, it can pronate and supinate effectively, but it exhibits a greater capacity for pronation. Both dorsiflexion and plantarflexion also demonstrate good range and strength, mirroring the left foot's capabilities.<br><br>Foot and Ankle summary: There is a noticeable asymmetry between the left and right feet, primarily in the degree of eversion and pronation. While both feet exhibit good movement capabilities, the right foot shows a slightly greater range of motion in pronation. To address the asymmetry, it is crucial to incorporate targeted strength training, particularly through isometric exercises, to enhance control and awareness in both feet. Additionally, incorporating dynamic movements that promote fascial control and midfoot articulation will be beneficial for overall foot function and stability.",
  "knee": "The Left knee achieved sufficient range in flexion, being 10% below our gold standard, while it demonstrated good range in extension, 1% above the gold standard. However, the left knee exhibited poor strength in both flexion and extension, with flexion being 42% below the gold standard. Notably, the left knee flexion was 4.7% stronger than the right, indicating a slight advantage in peak force during flexion.<br><br>The Right knee also showed sufficient range in flexion, 14% below the gold standard, and sufficient range in extension, 4% below the gold standard. The right knee was weaker than the left in both flexion and extension, with flexion strength being 51% below the gold standard. This resulted in a hamstring to quadriceps ratio that was poorer than the left knee, further emphasizing the need for strength improvement.<br><br>Knee summary: Both knees exhibit sufficient range in flexion, but there is a significant need for strength enhancement in both flexion and extension. The left knee shows a slight advantage in strength and range, but both knees have poor hamstring to quadriceps ratios. Focus should be placed on improving the peak force in flexion and overall strength to enhance knee stability and function.",
  "hip": "The Left hip showed sufficient range in flexion but deficits in extension, abduction, adduction, and internal rotation. Strength was significantly compromised across all movements, particularly in flexion, extension, abduction, and adduction, leading to concerns regarding movement patterns and overall hip joint integrity.<br><br>The Right hip demonstrated a similar pattern, with deficits in extension and internal rotation, while maintaining sufficient range in abduction. However, strength was also a major concern, with large deficits noted in flexion, extension, abduction, and adduction. This reduction in force production affects propulsion and overall functional capacity.<br><br>Hip summary: The deficits in hip extension range on both sides, particularly the large deficit on the right, impact pelvic alignment and stability. The strength deficits across multiple movements compromise propulsion and can lead to inefficient movement patterns. The notable asymmetries in internal and external rotation further highlight the need for improved hip joint integrity. Addressing these range and strength deficits is crucial for optimizing energy transfer and maintaining proper femur positioning during both closed and open-chain movements. Reducing the current asymmetries will enhance overall hip function and stability.",
  "shoulder": "The Left Shoulder demonstrated excellent external rotation, performing above the gold standard with a notable range. However, internal rotation was below the gold standard, indicating a slight deficiency. When assessing force, the left shoulder showed a significant reduction in external rotation force, which is concerning and suggests a weakness in this area.<br><br>The Right Shoulder also exhibited strong external rotation, matching the left in range, but internal rotation was slightly weaker compared to the left. The right shoulder displayed a notable reduction in external rotation force as well, though it was less pronounced than that of the left. In terms of internal rotation force, the right shoulder performed better than the left, indicating a relative strength in this motion.<br><br>Shoulder Summary: Both shoulders exhibit a strong external rotation range, but there is a notable weakness in external rotation force for both sides. The left shoulder has a greater deficiency in this area. To address these issues, we should focus on progressive overcoming isometrics to enhance external rotation strength, alongside shoulder mobilisation drills to improve overall function. Additionally, incorporating unilateral movements may help balance the asymmetries observed in internal rotation strength.",
  "overall_conclusion": "Our results indicate you have a forward head posture. This is characterised by thoracic kyphosis, which leads to a depression of the rib cage as the thorax tilts forward. This position results in the shoulders rounding forward, often placing them in an externally rotated position. Additionally, there is typically a loss of internal rotation at the pelvis, which can exacerbate external rotation. Your results suggest that you would benefit from specific correctives to address this posture and improve rib cage dynamics, as this position can have significant consequences during gait.<br><br>There are notable compensations occurring at the hip, with various strategies being employed to generate forward propulsion during gait and when engaging in closed-chain movements. Limitations in both internal rotation and hip extension were observed, indicating that the spine may be overused to create downward force. This overuse can lead to inefficiencies in movement patterns. It is essential to enhance your awareness of the mid-foot and focus on pressurizing through the ground to improve propulsion and overall hip function.<br><br>Our approach will focus on increasing the range of motion at the hip while integrating exercises that promote efficient loading patterns through the foot. This will help prevent overloading of key areas and improve joint articulation. Enhancing range of motion will also lead to better muscle contraction quality, allowing us to address the force discrepancies observed at both the knee and hip, ultimately improving your overall biomechanics.<br><br>To optimize your shoulder girdle function, we need to address the mechanics of your ribcage and scapula. A targeted approach involving heavy isometrics and eccentrics, following fascial release work, will facilitate quicker adaptation. Emphasis should be placed on strengthening the deltoids and the rotator cuff complex to enhance stability and control within the shoulder girdle. This comprehensive strategy will support improved shoulder function and overall upper body mechanics."
}